app/views/users/show.html.erb

          <div class="user-count">
            <span>Comments: <%= post.comments.count %></span>
            <span>Likes: <%= post.likes.count %></span>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 1]]